# Pandas dataframe get

In [1]:
import pandas as pd

In [5]:
data = pd.read_csv("/Users/archanaqueen/Desktop/employees.csv")

In [6]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

# get()

This method will get the column from the dataframe

In [7]:
data.get('Gender')

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [8]:
data['Gender']

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [9]:
data.Gender

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [10]:
data.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [11]:
data.get(['First Name','Gender','Team'])

    First Name  Gender                  Team
0      Douglas    Male             Marketing
1       Thomas    Male                   NaN
2        Maria  Female               Finance
3        Jerry    Male               Finance
4        Larry    Male       Client Services
..         ...     ...                   ...
995      Henry     NaN          Distribution
996    Phillip    Male               Finance
997    Russell    Male               Product
998      Larry    Male  Business Development
999     Albert    Male                 Sales

[1000 rows x 3 columns]

In [12]:
type(data.get(['First Name','Gender','Team']))

pandas.core.frame.DataFrame